[{"medicineName":"Dapsib Gel 15gm","disease":"Leprosy","rxRequired":true,"medicineType":"Adapalene 0.1 %+Dapsone 5 %","medicinePrice":200,"medicineCompany":"Indiabulls Pharmaceuticals Ltd","medicineDescription":"\n\nDAPSIB contains a combination of Adapalene and Dapsone, which belongs to the group of medicines called topical retinoids and sulfonamide antibiotics. It is used in the treatment of skin acne. Acne is a condition of the skin when the root of your hair (hair follicle) or skin pores gets clogged by oil or dead skin, which becomes prone to bacterial infection resulting in pimples, blackheads and spots or scars.\n\nAdapalene is a form of vitamin A (retinoid) that acts as an antiacne agent by binding directly to the receptors of the skin which increases the rate of cell regeneration and decreases oil secretion preventing clogging of the hair follicles and pores. It also reduces swelling and inflammation. Dapsone is an antibiotic with a structure similar to PABA (para-aminobenzoic acid) that kills bacteria by competitively substituting PABA, a nutrient that bacteria use to generate folic acid for growth and survival. Before recommending DAPSIB, your doctor may advise you to have tests to understand your existing condition for planning effective treatment methods. Stay well hydrated and protect your skin from exposure to sunlight or UV light.\n\nDo not apply DAPSIB if you are allergic to adapalene or dapsone or have bruises, cuts or burns on the skin, It should be used with caution and inform your doctor if have any disorder of the digestive system (colitis), a disorder of the immune system, anemia or G6PD deficiency. The common side effects of using DAPSIB may include dry skin, burning, itching, redness or irritative sensation of the skin and peeling of the skin.\n\n","medicineImage":["https://usc1.contabostorage.com/f49065475849480fbcd19fb8279b2f98:medstown/gels.jpg"],"medicineId":"MED38712256","dateOfRegistration":"2022-12-12T06:05:06.896Z"},{"medicineName":"Dapsone 100mg Tablet 1000'S","disease":"Leprosy","rxRequired":true,"medicineType":"Dapsone 100 mg","medicinePrice":375,"medicineCompany":"Glaxosmithkline Pharmaceuticals Ltd","medicineDescription":"\n\nDAPSONE 100MG TABLET contains Dapsone which belongs to the group of medicines called Sulfone antibiotics. It is used in the treatment of leprosy which is caused by bacterial infection and characterised by symptoms such as skin lesions and nerve damage and treats blistering skin disorders such as dermatitis herpetiformis (which is connected to gluten sensitivity).\n\nAlso, it prevents pneumonia (inflammation of the lungs caused by microorganisms in which the air sacs are filled with pus and may become solid) in immunodeficient patients (particularly in AIDS patients).\n\nBefore taking DAPSONE 100MG TABLET, inform your doctor if you have severe anaemia, porphyria (a disorder of the red blood pigment), severe glucose-6-phosphate dehydrogenase deficiency (G6PD) which can cause episodes of anaemia after eating certain foods such as fava beans, any type of blood disorders and heart, liver or lung diseases.\n\nDAPSONE 100MG TABLET should be used in pregnant and breast-feeding women only if advised by the doctor. Your doctor may prescribe folic acid supplements. DAPSONE 100MG TABLET can cause anaemia in infants when passed through the breast milk. Consult your doctor before taking this medicine.\n\nIt should be used with caution in children and adolescents (from 6 years of age to 12 years above). It should be used with caution in elderly patients particularly with liver impairment.\n\nThe most common side effects of taking DAPSONE 100MG TABLET are decreased number of red blood cells which may make you feel tired, signs of methemoglobinemia (blood disorder) such as shortness of breath, feeling tired, bluish tinge to the skin. Consult with your doctor if the symptoms get worse.\n\n","medicineImage":["https://usc1.contabostorage.com/f49065475849480fbcd19fb8279b2f98:medstown/dapsone_100mg_tablet_1000_s_0.jpg"],"medicineId":"MED92963922","dateOfRegistration":"2022-12-12T06:05:08.334Z"},{"medicineName":"Hansepran 100mg Capsule 10'S","disease":"Leprosy","rxRequired":true,"medicineType":"Clofazimine 100 mg","medicinePrice":38,"medicineCompany":"Abbott Healthcare Pvt Ltd","medicineDescription":"\n\nHANSEPRAN contains Clofazimine which belongs to the group of medicines called Antimycobacterial agents. It is used to treat lepromatous leprosy (including dapsone-resistant lepromatous leprosy and lepromatous leprosy complicated by erythema nodosum leprosum) in combination with other anti-leprosy drugs.\n\nLeprosy is a chronic and contagious infection caused by mycobacterium leprae which affects the skin, nerves outside the brain and spinal cord including upper respiratory tract’s mucosa, and eyes. It is generally characterized by symptoms such as discoloured skin patches with loss of sensations, numbness or tingling sensation (in hands, feet, arms and legs), painless wounds/burns (typically on hands and feet) and muscle weakness.\n\nHANSEPRAN is not recommended for use if you have a personal or family history of heart disease such as congenital long QT syndrome (a type of hereditary heart disease). It should be used with caution in patients with frequent stomach pain, continuous vomiting or diarrhoea, hepatitis B or C (liver infection), liver, kidney or other heart problems. HANSEPRAN should be used with caution in pregnant women and it is not recommended for use in breastfeeding women.\n\nHANSEPRAN is recommended for use in children and adolescents (aged 10 to 14 years) and it should be used with caution in children (aged below 10 years). Also, it should be used with caution in elderly patients (aged 65 years and above). Consult your doctor before taking HANSEPRAN. The common side effects associated with the use of HANSEPRAN are reversible reddish dark-brown discolouration of skin, hair and eyes, discolouration of body fluids (such as sweat, saliva, tears, urine, and stools), abdominal pain, diarrhoea, nausea, vomiting and dryness of skin. Consult your doctor if any of the symptom worsens.\n\n","medicineImage":["https://usc1.contabostorage.com/f49065475849480fbcd19fb8279b2f98:medstown/hansepran_100mg_capsule_10s_488295_2_2.jpg","https://usc1.contabostorage.com/f49065475849480fbcd19fb8279b2f98:medstown/hansepran_100mg_capsule_10s_488293_0_2.jpg","https://usc1.contabostorage.com/f49065475849480fbcd19fb8279b2f98:medstown/hansepran_100mg_capsule_10s_488294_1_2.jpg"],"medicineId":"MED27852358","dateOfRegistration":"2022-12-12T06:05:09.205Z"},{"medicineName":"Hansepran 50mg Capsule 10'S","disease":"Leprosy","rxRequired":true,"medicineType":"CLOFAZIMINE 50 MG","medicinePrice":22,"medicineCompany":"Abbott Healthcare Pvt Ltd","medicineDescription":"\n\nHANSEPRAN 50MG contains Clofazimine which belongs to the group of medicines called Antimycobacterial agents. It is used to treat lepromatous leprosy (including dapsone-resistant lepromatous leprosy and lepromatous leprosy complicated by erythema nodosum leprosum) in combination with other anti-leprosy drugs.\n\nLeprosy is a chronic and contagious infection caused by mycobacterium leprae which affects the skin, nerves outside the brain and spinal cord including upper respiratory tract’s mucosa, and eyes. It is generally characterized by symptoms such as discoloured skin patches with loss of sensations, numbness or tingling sensation (in hands, feet, arms and legs), painless wounds/burns (typically on hands and feet) and muscle weakness.\n\nHANSEPRAN 50MG is not recommended for use if you have a personal or family history of heart disease such as congenital long QT syndrome (a type of hereditary heart disease). It should be used with caution in patients with frequent stomach pain, continuous vomiting or diarrhoea, hepatitis B or C (liver infection), liver, kidney or other heart problems. HANSEPRAN 50MG should be used with caution in pregnant women and it is not recommended for use in breastfeeding women.\n\nHANSEPRAN 50MG is recommended for use in children and adolescents (aged 10 to 14 years) and it should be used with caution in children (aged below 10 years). Also, it should be used with caution in elderly patients (aged 65 years and above). Consult your doctor before taking HANSEPRAN 50MG. The common side effects associated with the use of HANSEPRAN 50MG are reversible reddish dark-brown discolouration of skin, hair and eyes, discolouration of body fluids (such as sweat, saliva, tears, urine, and stools), abdominal pain, diarrhoea, nausea, vomiting and dryness of skin. Consult your doctor if any of the symptom worsens.\n\n","medicineImage":["https://usc1.contabostorage.com/f49065475849480fbcd19fb8279b2f98:medstown/hansepran_50mg_capsule_10_s_0.jpg"],"medicineId":"MED3411120","dateOfRegistration":"2022-12-12T06:05:10.280Z"}]